tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_open_rim_corrected/system/controlDict
/* OpenFOAM v2512 compressible VOF - VW2011 Case B physical open-rim correction. */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
application     compressibleInterFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

// T* = t * sqrt(g*Dt)/L ; T*=6 → t≈10.4 s. Cover past Fig.6/8 window.
endTime         8.65;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.35;

maxAlphaCo      0.25;

maxDeltaT       0.001;

functions
{
    transducer
    {
        type            probes;
        libs            (sampling);
        fields          (p p_rgh alpha.water U);
        // VW: transducer in main pipe near invert, mid-chamber-to-tower reach
        probeLocations
        (
            (1.616 -0.043 0)
        );
        writeControl    adjustableRunTime;
        writeInterval   0.005;
    }

    towerCentreline
    {
        type            probes;
        libs            (sampling);
        fields          (alpha.water U p);
        // Through the physical tower bore; the atmosphere patch is at y=0.657 m.
        probeLocations
        (
            (3.516 0.052 0) (3.516 0.062 0) (3.516 0.072 0)
            (3.516 0.082 0) (3.516 0.092 0) (3.516 0.102 0)
            (3.516 0.112 0) (3.516 0.122 0) (3.516 0.132 0)
            (3.516 0.142 0) (3.516 0.152 0) (3.516 0.162 0)
            (3.516 0.172 0) (3.516 0.182 0) (3.516 0.192 0)
            (3.516 0.202 0) (3.516 0.212 0) (3.516 0.222 0)
            (3.516 0.232 0) (3.516 0.242 0) (3.516 0.252 0)
            (3.516 0.262 0) (3.516 0.272 0) (3.516 0.282 0)
            (3.516 0.292 0) (3.516 0.302 0) (3.516 0.312 0)
            (3.516 0.322 0) (3.516 0.332 0) (3.516 0.342 0)
            (3.516 0.352 0) (3.516 0.362 0) (3.516 0.372 0)
            (3.516 0.382 0) (3.516 0.392 0) (3.516 0.402 0)
            (3.516 0.412 0) (3.516 0.422 0) (3.516 0.432 0)
            (3.516 0.442 0) (3.516 0.452 0) (3.516 0.462 0)
            (3.516 0.472 0) (3.516 0.482 0) (3.516 0.492 0)
            (3.516 0.502 0) (3.516 0.512 0) (3.516 0.522 0)
            (3.516 0.532 0) (3.516 0.542 0) (3.516 0.552 0)
            (3.516 0.562 0) (3.516 0.572 0) (3.516 0.582 0)
            (3.516 0.592 0) (3.516 0.602 0) (3.516 0.612 0)
            (3.516 0.622 0) (3.516 0.632 0) (3.516 0.642 0)
            (3.516 0.652 0)
        );
        writeControl    adjustableRunTime;
        writeInterval   0.005;
    }
}

// ************************************************************************* //
