tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_open_rim_corrected/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    volScalarFieldValue p_rgh 105271.3
    volScalarFieldValue p 105271.3
    volScalarFieldValue T 293.15
);
regions
(
    boxToCell
    {
        box (-1 -1 -1) (0.546 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue p_rgh 107298.3
            volScalarFieldValue p 107298.3
        );
    }
    boxToCell
    {
        // Area-equivalent tower bore (W=Dt^2/D); air above Yfs0
        box (3.5151420213 0.403 -1) (3.5168579787 0.657 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue p_rgh 101325
            volScalarFieldValue p 101325
        );
    }
);
